Music_App/app/controllers/users_controller.rb

    def create
        @user = user.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "email", "session_token", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "jas"], ["email", "jas"], ["session_token", "Lqx6ljRmawQtIlS4CROVOA"], ["password_digest", "$2a$12$4INi7JoPFebguc6Tc1S.iuJOSQk6bVMa81XnXidVkffKpfVUih5We"]]